# Q1. List any five functions of the pandas library with execution.

1. read_csv()
2. head()
3. describe()
4. drop_duplicates()
5. sort_values()

# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [34]:
import pandas as pd
index=[i for i in range(1,21,2)]
A=[32,45,67,42,43,75,43,75,32,23]
B=[3,2,5,7,5,3,7,4,3,7]
C=[78,65,32,67,43,21,67,43,76,43]
dict={"A":A,"B":B,"C":C}
df=pd.DataFrame(dict)

In [35]:
df

    A  B   C
0  32  3  78
1  45  2  65
2  67  5  32
3  42  7  67
4  43  5  43
5  75  3  21
6  43  7  67
7  75  4  43
8  32  3  76
9  23  7  43

In [36]:
df1=df.reindex(index)

In [37]:
df1

       A    B     C
1   45.0  2.0  65.0
3   42.0  7.0  67.0
5   75.0  3.0  21.0
7   75.0  4.0  43.0
9   23.0  7.0  43.0
11   NaN  NaN   NaN
13   NaN  NaN   NaN
15   NaN  NaN   NaN
17   NaN  NaN   NaN
19   NaN  NaN   NaN

In [40]:
df2=pd.DataFrame(dict,index=index)

In [41]:
df2

     A  B   C
1   32  3  78
3   45  2  65
5   67  5  32
7   42  7  67
9   43  5  43
11  75  3  21
13  43  7  67
15  75  4  43
17  32  3  76
19  23  7  43

# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console. 
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [42]:
dict={"Values":[10,20,30,40,50]}
df=pd.DataFrame(dict)
df

   Values
0      10
1      20
2      30
3      40
4      50

In [43]:
a=0
for i in range(3):
    a+=df['Values'][i]
print(a)

60

# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [44]:
Text=['abs','dgf','werf','hgdsff','yrsa','uygsdyh']
dict={"Text":Text}
df=pd.DataFrame(dict)
df

      Text
0      abs
1      dgf
2     werf
3   hgdsff
4     yrsa
5  uygsdyh

In [46]:
df["Word_Count"]=[len(i) for i in df['Text']]

In [47]:
df

      Text  Word_Count
0      abs           3
1      dgf           3
2     werf           4
3   hgdsff           6
4     yrsa           4
5  uygsdyh           7

# Q5. How are DataFrame.size() and DataFrame.shape() different?

Pandas DataFrame size():
The size property is used to get an int representing the number of elements in this object and Return the number of rows if Series. Otherwise, return the number of rows times the number of columns if DataFrame.

Pandas DataFrame shape():
The shape property is used to get a tuple representing the dimensionality of the Pandas DataFrame.

# Q6. Which function of pandas do we use to read an excel file?

To read an excel file as a DataFrame, use the pandas read_excel() method. You can read the first sheet, specific sheets, multiple sheets or all sheets. Pandas converts this to the DataFrame structure, which is a tabular like structure.

# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [48]:
df=pd.DataFrame({'Email':['abc.ghf@gmail.com','hello.hi@redifmail.com','sahil@gmail.com','Rohan.patil@gmail.com']})

In [49]:
df

                    Email
0       abc.ghf@gmail.com
1  hello.hi@redifmail.com
2         sahil@gmail.com
3   Rohan.patil@gmail.com

In [66]:
def test(email_address):
    r = email_address.index("@")
    return "".join(l for l in email_address[:r] )

In [67]:
df["Username"]=list(map(test,df['Email']))

In [68]:
df

                    Email     Username
0       abc.ghf@gmail.com      abc.ghf
1  hello.hi@redifmail.com     hello.hi
2         sahil@gmail.com        sahil
3   Rohan.patil@gmail.com  Rohan.patil

# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows. For example, if df contains the following values:

In [69]:
"""
  A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2"""

'\n  A B C\n0 3 5 1\n1 8 2 7\n2 6 9 4\n3 2 3 5\n4 9 1 2'

In [99]:
dict={"A":[3,8,6,2,9,5,4,21,72,8],
      "B":[5,20,90,3,1,60,11,23,35,10],
       "C":[1,7,4,5,2,1,5,3,2,7]}
df=pd.DataFrame(dict)
df

    A   B  C
0   3   5  1
1   8  20  7
2   6  90  4
3   2   3  5
4   9   1  2
5   5  60  1
6   4  11  5
7  21  23  3
8  72  35  2
9   8  10  7

In [100]:
A=list(df['A'])
B=list(df['B'])

In [106]:
A1=[]
B1=[]
C1=[]
for i in range(10):
    if (A[i]>5) & (B[i]>10):
        A1.append(A[i])
        B1.append(B[i])
        C1.append(df['C'][i])

In [108]:
dict1={"A":A1,"B":B1,"C":C1}

In [109]:
df1=pd.DataFrame(dict1)

In [110]:
df1

    A   B  C
0   8  20  7
1   6  90  4
2  21  23  3
3  72  35  2